In [1]:
import sqlite3

# connect to the database (file will be created id doesnot exist)
conn = sqlite3.connect('students.db')

#create a cursor to execute a sql
cursor=conn.cursor()

#create table
#sqlite data types
#integer
#real-float
#text-string,date,character
#blob-binary data
#null

cursor.execute("""
create table if not exists students(
    id integer primary key autoincrement,
    name text not null,
    grade integer,
    address text
)"""
)

conn.commit()

In [4]:
# insert into table
cursor.execute("""insert into students(name,grade,address)
values
('Lin',12,'ktm'),
('Lina',11,'ktm')""")
conn.commit()

In [7]:
# select
cursor.execute("""select * from students""")
rows = cursor.fetchall()

In [8]:
for items in rows:
    print(items)

(1, 'Lin', 12, 'ktm')
(2, 'Lina', 11, 'ktm')
(3, 'Lin', 12, 'ktm')
(4, 'Lina', 11, 'ktm')

In [11]:
# update
cursor.execute("""update students
set address = 'Lalitpur'
where name = 'Lin' """)
conn.commit()

In [12]:
#  insert new record into students
cursor.execute(""" insert into students(name, grade,address)
               values
               ('Bishal',10, 'nuwakot')
               """)
conn.commit()

In [13]:
#task2 select from students where id = 4
cursor.execute(""" select*from students where id =3""")
rows = cursor.fetchall()

In [14]:
rows

[(3, 'Lin', 12, 'Lalitpur')]

In [15]:
# parameterized query - where user can pass the parameter
# ? - placeholder
# values are passed as tuple and list

In [16]:
conn = sqlite3.connect('students.db')

In [17]:
cursor = conn.cursor()

In [18]:
name = 'Bishal'

In [20]:
cursor.execute("select * from  students where name = ?", (name,))

In [21]:
cursor.fetchall()

[(5, 'Bishal', 10, 'nuwakot')]

In [22]:
# task 4 -- create a list of students record and pass it as parameterized query
# to insert into students table

In [30]:


students_list =[('ram', 10, 'ktm'),('sita', 11,'chitwam'), ('Rira',2,'pokhara')]
cursor.executemany("""insert into students(name,grade,address)
                   values(?,?,?)""",students_list )

conn.commit()
cursor.fetchall()
cursor.execute("select* from students")
rows = cursor.fetchall()

In [31]:
rows

[(1, 'Lin', 12, 'Lalitpur'),
 (2, 'Lina', 11, 'ktm'),
 (3, 'Lin', 12, 'Lalitpur'),
 (4, 'Lina', 11, 'ktm'),
 (5, 'Bishal', 10, 'nuwakot'),
 (6, 'ram', 10, 'ktm'),
 (7, 'sita', 11, 'chitwam'),
 (8, 'Rira', 2, 'pokhara'),
 (9, 'ram', 10, 'ktm'),
 (10, 'sita', 11, 'chitwam'),
 (11, 'Rira', 2, 'pokhara'),
 (12, 'ram', 10, 'ktm'),
 (13, 'sita', 11, 'chitwam'),
 (14, 'Rira', 2, 'pokhara'),
 (15, 'ram', 10, 'ktm'),
 (16, 'sita', 11, 'chitwam'),
 (17, 'Rira', 2, 'pokhara')]